UNFCOPY.саУНФУправлениеАссортиментом/src/DataProcessors/саУНФ_ПечатьQR/саУНФ_ПечатьQR.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>саУНФ_ПечатьQR</name>
</mdclass:DataProcessor>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/ВыставлениеСчетовBePaid/ВыставлениеСчетовBePaid.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыставлениеСчетовBePaid</name>
  <resources>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СервисНомерERIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>QR</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>QR_RAW</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СпособОплаты/СпособОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособОплаты</name>
  <enumValues>
    <name>Card</name>
  </enumValues>
  <enumValues>
    <name>ERIP</name>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/DataProcessors/саУНФ_ПечатьQR/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Функция ПредставлениеПФ()  Экспорт
		Возврат НСтр("ru = 'Этикетка счета'");		
	КонецФункции
	
	Функция КлючПараметровПечати()  Экспорт
		Возврат "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАСЧЕТА";
	КонецФункции
	
	Функция ПолныйПутьКМакету() Экспорт
		Возврат "Обработка.саУНФ_ПечатьQR.ПФ_MXL_ЭтикеткаСчета";
	КонецФункции
	
	Функция ИдентификаторПечатнойФормы() Экспорт
		
		Возврат  "ЭтикеткаСчета";
		
	КонецФункции
	
	
	#Область Печать
	Процедура ВывестиQRКод(QRСтрока,ОбластьМакета)
		
		
		Если Не ПустаяСтрока(QRСтрока) Тогда
			
			ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
			
			Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
				КартинкаQRКода = Новый Картинка(ДанныеQRКода);
				ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода;
			Иначе
				Шаблон = Нстр("ru = 'Не удалось сформировать QR-код для документа %1.
				|Технические подробности см. в журнале регистрации.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,QRСтрока);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция ПолучитьПоследнийВыставленныйСчет(МассивОбъектов)
	             		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыставлениеСчетовBePaid.QR_RAW КАК QR_RAW,
		|	ВыставлениеСчетовBePaid.QR КАК QR,
		|	ВыставлениеСчетовBePaid.ДатаСоздания КАК ДатаСоздания,
		|	ВыставлениеСчетовBePaid.email КАК email,
		|	ВыставлениеСчетовBePaid.Сумма КАК Сумма,
		|	ВыставлениеСчетовBePaid.Заказ.Контрагент.Представление КАК Контрагент,
		|	ВыставлениеСчетовBePaid.НомерЗаказа КАК НомерЗаказа,
		|	ВыставлениеСчетовBePaid.СпособОплаты КАК СпособОплаты,
		|	ВыставлениеСчетовBePaid.Валюта.Представление КАК Валюта
		|ИЗ
		|	РегистрСведений.ВыставлениеСчетовBePaid КАК ВыставлениеСчетовBePaid
		|ГДЕ
		|	ВыставлениеСчетовBePaid.Заказ В(&МассивЗаказов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	        Возврат Ложь;
	КонецЕсли; 
	
	ТаблицаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	СтрокаТаб = ТаблицаДетальныеЗаписи[ТаблицаДетальныеЗаписи.Количество()-1];
	СтруктураЗаказа = Новый Структура("QR_RAW,QR,ДатаСоздания,email,Сумма,Контрагент,НомерЗаказа,СпособОплаты,Валюта");
	ЗаполнитьЗначенияСвойств(СтруктураЗаказа,СтрокаТаб);	
	
	Возврат  СтруктураЗаказа;
		
	
	КонецФункции // ()
	 
	Функция ТекстПоясненияЕРИП()
		Текст= Символы.Таб+Символы.Таб+"Как оплатить заказ" +Символы.ПС;
		Текст=Текст+"Оплата в системе ""Расчёт"" (ЕРИП):"+Символы.ПС;
		Текст=Текст+"Оплатить услуги интернет-магазина 1ak.by Вы можете через систему ""Расчет"" (ЕРИП),
		|в любом удобном для Вас месте, в удобное для Вас время, в удобном для Вас пункте банковского обслуживания – интернет-банкинге, 
		|М-банкинге, инфокиоске, кассе банков, банкомате и т.д. Совершить оплату можно с использованием наличных денежных средств, 
		|электронных денег и банковских платежных карточек в пунктах банковского обслуживания банков, которые оказывают услуги по приему платежей, 
		|а также посредством инструментов дистанционного банковского обслуживания."+Символы.ПС;
		Текст=Текст+Символы.Таб+Символы.Таб+"ДЛЯ ПРОВЕДЕНИЯ ПЛАТЕЖА НЕОБХОДИМО:"+Символы.ПС;
		Текст=Текст+"1. Выбрать: " +Символы.ПС;
		Текст=Текст+"Пункт Система ""Расчет"" (ЕРИП)" +Символы.ПС;
		Текст=Текст+"Интернет-магазины/сервисы " +Символы.ПС;
		Текст=Текст+"0-9 Цифровые домены " +Символы.ПС;
		Текст=Текст+"1 " +Символы.ПС;
		Текст=Текст+"1ak.by " +Символы.ПС;
		Текст=Текст+"2. Для оплаты ввести Номер заказа. " +Символы.ПС;
		Текст=Текст+"3. Проверить корректность информации " +Символы.ПС;
		Текст=Текст+"4. Совершить платеж. " +Символы.ПС;
		Текст=Текст+"Если Вы осуществляете платеж в кассе банка сообщите кассиру о необходимости проведения платежа через систему ""Расчет"" (ЕРИП)." +Символы.ПС;
		
		 Возврат Текст;
	КонецФункции // ()
	 
	Функция ТекстПоясненияONLINE()
		
		Текст= Символы.Таб+Символы.Таб+"Оплата онлайн:" +Символы.ПС;
		Текст=Текст+"ДЛЯ ПРОВЕДЕНИЯ ОПЛАТЫ НЕОБХОДИМО:"+Символы.ПС;
		Текст=Текст+"1. Получить от Поставщика ссылку и QR-код на email:" +Символы.ПС;
		Текст=Текст+Символы.Таб+"Обращаем Ваше внимание, что оплата по ссылке доступна 24 часа, по истечению этого времени ссылка становится недействительной."+Символы.ПС;
		Текст=Текст+"2. Перейти по полученной ссылке, либо отсканировать QR-код." +Символы.ПС;
		Текст=Текст+"3. Выбрать тип оплаты:" +Символы.ПС;
		Текст=Текст+Символы.Таб+"1) оплатить через GPay" +Символы.ПС;
		Текст=Текст+Символы.Таб+"2) оплатить картой: выбрать тип карты, после переадресации на защищённую страницу банка ввести номер карточки (16 цифр), срок её действия, имя держателя карты (латиницей, как написано на карте) и уникальный трёхзначный код" +Символы.ПС;
		Текст=Текст+Символы.Таб+"3) ЕРИП" +Символы.ПС;
		Текст=Текст+"4. Нажать кнопку Оплатить." +Символы.ПС;
		Текст=Текст+"5. В случае успешного завершения операции Вы увидите соответствующее уведомление." +Символы.ПС;
		
		 Возврат Текст;
	КонецФункции // ()

	
	
	Функция СформироватьПФ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати)   Экспорт
		//QRСтрока = "https://checkout.bepaid.by/widget/hpp.html?token=2bfdca05a61de154ed29f8d230ba81b73f228cb83771b4ce0b6c23980d8f092c";
		//НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументов.Номер, Истина, Истина);
		СтруктураЗаказа=ПолучитьПоследнийВыставленныйСчет(МассивОбъектов);
		Если ТипЗнч(СтруктураЗаказа)=Тип("Булево") Тогда
		    ШаблонСообщения =  СтрШаблон("Счет по номеру заказа %1 не был выставлен", ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(МассивОбъектов[0].Номер,Истина,Истина));
			ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения);
			Возврат Ложь;
		КонецЕсли; 
		
		Если  СтруктураЗаказа.СпособОплаты = Перечисления.СпособОплаты.ERIP Тогда
		       QRСтрока=СокрЛП(СтруктураЗаказа.QR);
		ИначеЕсли  СтруктураЗаказа.СпособОплаты = Перечисления.СпособОплаты.Card Тогда
	           QRСтрока=СокрЛП(СтруктураЗаказа.QR_RAW);
		КонецЕсли; 
		
		Если  ПустаяСтрока(QRСтрока) Тогда
			ШаблонСообщения =  СтрШаблон("Счет по номеру заказа %1 не был выставлен", ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(МассивОбъектов[0].Номер,Истина,Истина));
			ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения);
			Возврат Ложь;
		КонецЕсли; 
				
		ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
		ПолныйПутьКМакету	=	ПечатнаяФорма.ПолныйПутьКМакету;
		ПервыйДокумент = Истина;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы(ПолныйПутьКМакету);
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьМакета = Макет.ПолучитьОбласть("Этикетка");
		
		Если СтруктураЗаказа.СпособОплаты = Перечисления.СпособОплаты.ERIP И Лев(QRСтрока,4)="data" Тогда
			QRСтрока=СокрЛП(СтрЗаменить(QRСтрока,"data:image/png;base64,","")); 
			ДвоичныеДанныеКартинки=Base64Значение(QRСтрока);
			КартинкаQRКода = Новый Картинка(ДвоичныеДанныеКартинки);
			ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода;
			ОбластьМакета.Параметры.Пояснение =  ТекстПоясненияЕРИП();
        ИначеЕсли СтруктураЗаказа.СпособОплаты = Перечисления.СпособОплаты.Card И Лев(QRСтрока,4)="http" Тогда
			ВывестиQRКод(QRСтрока,ОбластьМакета);
			ОбластьМакета.Параметры.Описание =СтруктураЗаказа.QR_RAW;
			ОбластьМакета.Параметры.ПереходПоССылке  =  СтруктураЗаказа.QR_RAW;
			ОбластьМакета.Параметры.Пояснение =  ТекстПоясненияONLINE();
		Иначе
			 ШаблонСообщения =  СтрШаблон("Счет по номеру заказа %1 не найден", ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(МассивОбъектов[0].Номер,Истина,Истина));
			ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения);
            Возврат Ложь;
		КонецЕсли; 
		 		 
		 ОбластьМакета.Параметры.Заполнить(СтруктураЗаказа);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		Возврат ТабличныйДокумент;
		
	КонецФункции
	
	
	
	
	
	
	
	
	#КонецОбласти
#КонецЕсли
